source/.NET Standard/Unimake.Business.DFe/Servicos/Config/NFSe/MorrinhosGO.xml

<?xml version="1.0" encoding="utf-8"?>
<Configuracoes>
  <Servicos ID="NFSe">
    <RecepcionarLoteRps versao="2.01">
      <Descricao>Recepcionar Lote RPS</Descricao>
      <WebEnderecoHomologacao></WebEnderecoHomologacao>
      <WebEnderecoProducao>http://187.52.105.85:8080/prodataws/services/NfseWSService</WebEnderecoProducao>
      <WebActionHomologacao></WebActionHomologacao>
      <WebActionProducao>http://services.nfse/RecepcionarLoteRps</WebActionProducao>
      <SchemaArquivo>nfse_v2_01.xsd</SchemaArquivo>
      <TagAssinatura>Rps</TagAssinatura>
      <TagAtributoID>InfDeclaracaoPrestacaoServico</TagAtributoID>
      <TagLoteAssinatura>EnviarLoteRpsEnvio</TagLoteAssinatura>
      <TagLoteAtributoID>LoteRps</TagLoteAtributoID>
      <WebContentType>text/xml;charset=UTF-8</WebContentType>
      <WebSoapString><![CDATA[<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><RecepcionarLoteRpsRequest xmlns="http://services.nfse"><nfseCabecMsg xmlns="">&lt;cabecalho&gt;&lt;versaoDados&gt;2.01&lt;/versaoDados&gt;&lt;/cabecalho&gt;</nfseCabecMsg><nfseDadosMsg xmlns="">{xmlBodyScape}</nfseDadosMsg></RecepcionarLoteRpsRequest></soap:Body></soap:Envelope>]]></WebSoapString>
      <WebTagRetorno>outputXML</WebTagRetorno>
      <WebEncodingRetorno>UTF-8</WebEncodingRetorno>
      <WebSoapVersion>soap11</WebSoapVersion>
      <SchemaVersao>2.01</SchemaVersao>
      <TargetNS>http://www.abrasf.org.br/nfse.xsd</TargetNS>
    </RecepcionarLoteRps>
    <CancelarNfse versao="2.01">
      <Descricao>Cancelar nota fiscal de serviço</Descricao>
      <WebEnderecoHomologacao></WebEnderecoHomologacao>
      <WebEnderecoProducao>http://187.52.105.85:8080/prodataws/services/NfseWSService</WebEnderecoProducao>
      <WebActionHomologacao></WebActionHomologacao>
      <WebActionProducao>http://services.nfse/CancelarNfse</WebActionProducao>
      <SchemaArquivo>nfse_v2_01.xsd</SchemaArquivo>
      <TagAssinatura>Pedido</TagAssinatura>
      <TagAtributoID>InfPedidoCancelamento</TagAtributoID>
      <TagLoteAssinatura></TagLoteAssinatura>
      <TagLoteAtributoID></TagLoteAtributoID>
      <WebContentType>text/xml;charset=UTF-8</WebContentType>
      <WebSoapString><![CDATA[<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><CancelarNfseRequest xmlns="http://services.nfse"><nfseCabecMsg xmlns="">&lt;cabecalho&gt;&lt;versaoDados&gt;2.01&lt;/versaoDados&gt;&lt;/cabecalho&gt;</nfseCabecMsg><nfseDadosMsg xmlns="">{xmlBodyScape}</nfseDadosMsg></CancelarNfseRequest></soap:Body></soap:Envelope>]]></WebSoapString>
      <WebTagRetorno>outputXML</WebTagRetorno>
      <WebEncodingRetorno>UTF-8</WebEncodingRetorno>
      <WebSoapVersion>soap11</WebSoapVersion>
      <SchemaVersao>2.01</SchemaVersao>
      <TargetNS>http://www.abrasf.org.br/nfse.xsd</TargetNS>
    </CancelarNfse>
    <ConsultarLoteRps versao="2.01">
      <Descricao>Consulta lote RPS</Descricao>
      <WebEnderecoHomologacao></WebEnderecoHomologacao>
      <WebEnderecoProducao>http://187.52.105.85:8080/prodataws/services/NfseWSService</WebEnderecoProducao>
      <WebActionHomologacao></WebActionHomologacao>
      <WebActionProducao>http://services.nfse/ConsultarLoteRps</WebActionProducao>
      <SchemaArquivo>nfse_v2_01.xsd</SchemaArquivo>
      <TagAssinatura></TagAssinatura>
      <TagAtributoID></TagAtributoID>
      <TagLoteAssinatura></TagLoteAssinatura>
      <TagLoteAtributoID></TagLoteAtributoID>
      <WebContentType>text/xml;charset=UTF-8</WebContentType>
      <WebSoapString><![CDATA[<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><ConsultarLoteRpsRequest xmlns="http://services.nfse"><nfseCabecMsg xmlns="">&lt;cabecalho&gt;&lt;versaoDados&gt;2.01&lt;/versaoDados&gt;&lt;/cabecalho&gt;</nfseCabecMsg><nfseDadosMsg xmlns="">{xmlBodyScape}</nfseDadosMsg></ConsultarLoteRpsRequest></soap:Body></soap:Envelope>]]></WebSoapString>
      <WebTagRetorno>outputXML</WebTagRetorno>
      <WebEncodingRetorno>UTF-8</WebEncodingRetorno>
      <WebSoapVersion>soap11</WebSoapVersion>
      <SchemaVersao>2.01</SchemaVersao>
      <TargetNS>http://www.abrasf.org.br/nfse.xsd</TargetNS>
    </ConsultarLoteRps>
    <ConsultarNfsePDF versao="2.01">
      <Descricao>Consulta/Download do PDF da NFSe</Descricao>
      <WebEnderecoHomologacao></WebEnderecoHomologacao>
      <WebEnderecoProducao>http://187.52.105.85:8080/prodataws/services/NotapdfWSService</WebEnderecoProducao>
      <WebActionHomologacao></WebActionHomologacao>
      <WebActionProducao>http://services.notapdf/ConsultarNotapdf</WebActionProducao>
      <SchemaArquivo></SchemaArquivo>
      <TagAssinatura></TagAssinatura>
      <TagAtributoID></TagAtributoID>
      <TagLoteAssinatura></TagLoteAssinatura>
      <TagLoteAtributoID></TagLoteAtributoID>
      <WebContentType>text/xml;charset=UTF-8</WebContentType>
	  <WebSoapString><![CDATA[<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://services.notapdf"><soapenv:Header/><soapenv:Body><ser:ConsultarNotapdfRequest><notapdfCabecMsg>&lt;cabecalho&gt;&lt;versaoDados&gt;2.01&lt;/versaoDados&gt;&lt;/cabecalho&gt;</notapdfCabecMsg><notapdfDadosMsg>{xmlBodyScape}</notapdfDadosMsg></ser:ConsultarNotapdfRequest></soapenv:Body></soapenv:Envelope>]]></WebSoapString>
	  <WebTagRetorno>outputXML</WebTagRetorno>
      <WebEncodingRetorno>UTF-8</WebEncodingRetorno>
      <WebSoapVersion>soap11</WebSoapVersion>
      <SchemaVersao>2.01</SchemaVersao>
      <TargetNS>http://www.abrasf.org.br/nfse.xsd</TargetNS>
    </ConsultarNfsePDF>
  </Servicos>
</Configuracoes>