source/.NET Standard/Unimake.Business.DFe/Servicos/Config/NFSe/CatalaoGO.xml

<?xml version="1.0" encoding="utf-8"?>
<Configuracoes>
  <Servicos ID="NFSe">
    <RecepcionarLoteRps versao="2.01">
      <Descricao>Recepcionar Lote RPS</Descricao>
      <WebEnderecoHomologacao></WebEnderecoHomologacao>
      <WebEnderecoProducao>https://ws.catalao.go.gov.br/prodataws/services/NfseWSService?wsdl</WebEnderecoProducao>
      <WebActionHomologacao></WebActionHomologacao>
      <WebActionProducao>http://services.nfse/RecepcionarLoteRps</WebActionProducao>
      <WebContentType>text/xml;charset=UTF-8</WebContentType>
      <WebSoapString><![CDATA[<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><RecepcionarLoteRpsRequest xmlns="http://services.nfse"><nfseCabecMsg xmlns="">&lt;cabecalho&gt;&lt;versaoDados&gt;2.01&lt;/versaoDados&gt;&lt;/cabecalho&gt;</nfseCabecMsg><nfseDadosMsg xmlns="">{xmlBodyScape}</nfseDadosMsg></RecepcionarLoteRpsRequest></soap:Body></soap:Envelope>]]></WebSoapString>
      <WebTagRetorno>outputXML</WebTagRetorno>
      <WebEncodingRetorno>UTF-8</WebEncodingRetorno>
      <WebSoapVersion>soap11</WebSoapVersion>
      <SchemaVersao>2.01</SchemaVersao>
      <TargetNS>http://www.abrasf.org.br/nfse.xsd</TargetNS>
    </RecepcionarLoteRps>
    <CancelarNfse versao="2.01">
      <Descricao>Cancelar nota fiscal de serviço</Descricao>
      <WebEnderecoHomologacao></WebEnderecoHomologacao>
      <WebEnderecoProducao>https://ws.catalao.go.gov.br/prodataws/services/NfseWSService?wsdl</WebEnderecoProducao>
      <WebActionHomologacao></WebActionHomologacao>
      <WebActionProducao>http://services.nfse/CancelarNfse</WebActionProducao>
      <WebContentType>text/xml;charset=UTF-8</WebContentType>
      <WebSoapString><![CDATA[<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><CancelarNfseRequest xmlns="http://services.nfse"><nfseCabecMsg xmlns="">&lt;cabecalho&gt;&lt;versaoDados&gt;2.01&lt;/versaoDados&gt;&lt;/cabecalho&gt;</nfseCabecMsg><nfseDadosMsg xmlns="">{xmlBodyScape}</nfseDadosMsg></CancelarNfseRequest></soap:Body></soap:Envelope>]]></WebSoapString>
      <WebTagRetorno>outputXML</WebTagRetorno>
      <WebEncodingRetorno>UTF-8</WebEncodingRetorno>
      <WebSoapVersion>soap11</WebSoapVersion>
      <SchemaVersao>2.01</SchemaVersao>
      <TargetNS>http://www.abrasf.org.br/nfse.xsd</TargetNS>
    </CancelarNfse>
    <ConsultarLoteRps versao="2.01">
      <Descricao>Consulta lote RPS</Descricao>
      <WebEnderecoHomologacao></WebEnderecoHomologacao>
      <WebEnderecoProducao>https://ws.catalao.go.gov.br/prodataws/services/NfseWSService?wsdl</WebEnderecoProducao>
      <WebActionHomologacao></WebActionHomologacao>
      <WebActionProducao>http://services.nfse/ConsultarLoteRps</WebActionProducao>
      <WebContentType>text/xml;charset=UTF-8</WebContentType>
      <WebSoapString><![CDATA[<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><ConsultarLoteRpsRequest xmlns="http://services.nfse"><nfseCabecMsg xmlns="">&lt;cabecalho&gt;&lt;versaoDados&gt;2.01&lt;/versaoDados&gt;&lt;/cabecalho&gt;</nfseCabecMsg><nfseDadosMsg xmlns="">{xmlBodyScape}</nfseDadosMsg></ConsultarLoteRpsRequest></soap:Body></soap:Envelope>]]></WebSoapString>
      <WebTagRetorno>outputXML</WebTagRetorno>
      <WebEncodingRetorno>UTF-8</WebEncodingRetorno>
      <WebSoapVersion>soap11</WebSoapVersion>
      <SchemaVersao>2.01</SchemaVersao>
      <TargetNS>http://www.abrasf.org.br/nfse.xsd</TargetNS>
    </ConsultarLoteRps>
  </Servicos>
</Configuracoes>